from sklearn.decomposition import PCA
data = [[25.48, 62.12, 0, 2.35, 152.47, 114.66, 43.72, 58.61],
        [160.66, 3.18, 28.77, 179.09, 29.06, 137.79, 8.03, 29.04],
        [42.94, 91.53, 39.32, 3.86, 130.99, 150.19, 97.3, 122.21],
        [21.33, 124.5, 0, 0.96, 215.09, 161.24, 117.92, 96.15],
        [23.74, 216.05, 132.79, 0.56, 291.92, 200.73, 103.67, 124.49]]

pca = PCA(n_components=2)
myPCA = pca.fit_transform(data)

vocab = "之的說曰了不他我"
for v, p1, p2 in zip(vocab, pca.components_[0], pca.components_[1]):
    print(f"\"{v}\":[{p1:.2f},{p2:.2f}],")
